#+title: 减肥记录
#+date: 2025-01-19T19:50:02+01:00
#+lastmod: 2025-01-19T19:50:02+01:00
# ISO 8601 date use output from
# C-u M-! date -Iseconds
#+draft: false
#+tags[]:

记录自己减肥的进度。包含跑步统计和饮食统计。

# more
* 目标
身高179厘米的目标是64公斤。这个目标对应BMI=20.0。


* 跑步

我争取每天跑七公里，用时45分钟。跑步是使用手表和GadgetBridge记录的。

| 日期             | 里程 公里 | 体重 公斤 |
|------------------+-----------+-----------|
| <2025-01-19 Sun> |     142.6 |      71.2 |

* 饮食

若未另外说明，均以百克为单位。
植物油以百毫升为单位。
鸡蛋以颗为单位，估计每颗去壳50g。
用 =C-c }= 显示表格调试模式。

在修改计算函数后，用 =C-u C-c C-c= 来重新计算结果。

** 二五年一月

*** <2025-01-19 Sun>
| 食品     | 单位 | 单位kcal | 用量 | 用量kcal |
|----------+------+----------+------+----------|
| 半熟米   | 百克 |      350 |  4.5 |    1575. |
| 土豆     | 百克 |       87 |    3 |      261 |
| 红小扁豆 | 百克 |      306 |    1 |      306 |
| 白菜     | 百克 |       25 |    5 |      125 |
| 全麦面条 | 百克 |      336 |    0 |        0 |
| 瓜子油   | 百ml |      828 |  0.6 |    496.8 |
| 鸡蛋去壳 | 百克 |      155 |    0 |        0 |
| 洋葱     | 百克 |       40 |    0 |        0 |
| 苹果     | 百克 |       52 |    0 |        0 |
| 香蕉去皮 | 百克 |       89 |    0 |        0 |
| 橙子     | 百克 |       47 |    0 |        0 |
| 鹰嘴豆   | 百克 |      360 |    0 |        0 |
| 其他     |      |        1 |    0 |        0 |
|----------+------+----------+------+----------|
| 总计     |      |          |      |   2763.8 |
#+TBLFM: @>$5=vsum(@I$5..@II$5);::@<<$5..@>>$5=($3 $4)

# comment:
# @>$5=vsum(@I$5..@II$5)
# @> refers to the last row, $5 refers to the fifth col
# @I..@II refers to the region between first hline and second hline
# @I$5..@II$5 refers to the region of fifth col between first hline and second hline

# @<<$5..@>>$5=($3 $4)
# @<<..@>> refers to the region between third line and third to last line.
# excluding first and last two lines.

* 食品卡路里换算
数据来源：食品包装袋、USDA via wikipedia。

| 食品     | 单位 | kcal | 来源       |
|----------+------+------+------------|
| 半熟米   | 百克 |  350 | verpackung |
| 土豆     | 百克 |   87 | usda       |
| 红小扁豆 | 百克 |  306 | verpackung |
| 白菜     | 百克 |   25 | usda       |
| 全麦面条 | 百克 |  336 | verpackung |
| 瓜子油   | 百ml |  828 | verpackung |
| 鸡蛋去壳 | 百克 |  155 | usda       |
| 洋葱     | 百克 |   40 | usda       |
| 苹果     | 百克 |   52 | usda       |
| 香蕉去皮 | 百克 |   89 | usda       |
| 橙子     | 百克 |   47 | usda       |
| 鹰嘴豆   | 百克 |  360 | verpackung |
